# 단축키
# # 주석 컨트롤 + /
# # 행이동 알트 + 화살표

print("1 + 2 =", 1 + 2)
print("1 - 2 =", 1 - 2)
print("1 * 2 =", 1 * 2)
print("1 / 2 =", 1 / 2)
print("2 ** 3 =", 2 ** 3)
print("3 // 2 =", 3 // 2)
print("1 % 2 =", 1 % 2)

# python의 연산자
# + 더하기
# - 빼기
# * 곱하기
# / 나누기
# ** 제곱
# // 정수나누기(몫)
# % 나머지

print('ㅡㅡㅡㅡㅡㅡㅡㅡ')
print("반갑습니다")
print('안녕하세요')
print("그는 생각했다. '생각생각' ")
print('그녀는 말했다. "말말말" ')
print("쌍따옴표 사용하기 \" ")

print('ㅡㅡㅡㅡㅡㅡㅡㅡ')
print('n\n\tt')
print("""안녕하세요
반갑습니다
잘부탁드립니다
안녕히계세요""") # 여러줄 한번에 출력

# 이스케이프 문자
# \n 줄바꿈
# \t 탭
# \" 쌍따옴표
# \' 따옴표

# print('''안녕하세요
# 반갑습니다
# 잘부탁드립니다
# 안녕히계세요''')      그냥 따옴표도 가능

print('ㅡㅡㅡㅡㅡㅡㅡㅡ')
# 숫자형 세가지
# 정수형 int
# 실수형 float
# 허수형 complex